[Survived] ConditionalExpression
builder/implementation/wallet.ts:55:7
-     if (typeof amount === "number") {
+     if (true) {

[Survived] ConditionalExpression
builder/implementation/wallet.ts:70:36
-       if (typeof max !== "bigint" || max < 0n) {
+       if (typeof max !== "bigint" || false) {

[Survived] StringLiteral
builder/implementation/wallet.ts:71:28
-         throw new RangeError("maxBalance must be a non-negative bigint");
+         throw new RangeError("");

[Survived] StringLiteral
builder/implementation/wallet.ts:74:28
-         throw new RangeError("initialBalance must be a non-negative bigint");
+         throw new RangeError("");

[Survived] StringLiteral
builder/implementation/wallet.ts:77:28
-         throw new RangeError("initialBalance must not exceed maxBalance");
+         throw new RangeError("");
