[Survived] ArithmeticOperator
builder/implementation/wallet.ts:50:29
-   const DEFAULT_MAX_BALANCE = (1n << 63n) - 1n; // 9223372036854775807
+   const DEFAULT_MAX_BALANCE = (1n << 63n) + 1n; // 9223372036854775807

[Survived] LogicalOperator
builder/implementation/wallet.ts:70:9
-       if (typeof max !== "bigint" || max < 0n) {
+       if (typeof max !== "bigint" && max < 0n) {

[Survived] ConditionalExpression
builder/implementation/wallet.ts:70:9
-       if (typeof max !== "bigint" || max < 0n) {
+       if (false || max < 0n) {

[Survived] ConditionalExpression
builder/implementation/wallet.ts:70:9
-       if (typeof max !== "bigint" || max < 0n) {
+       if (false) {

[Survived] ConditionalExpression
builder/implementation/wallet.ts:73:9
-       if (typeof initial !== "bigint" || initial < 0n) {
+       if (false || initial < 0n) {

[Survived] ConditionalExpression
builder/implementation/wallet.ts:73:9
-       if (typeof initial !== "bigint" || initial < 0n) {
+       if (false) {

[Survived] EqualityOperator
builder/implementation/wallet.ts:70:36
-       if (typeof max !== "bigint" || max < 0n) {
+       if (typeof max !== "bigint" || max <= 0n) {

[Survived] BlockStatement
builder/implementation/wallet.ts:70:46
-       if (typeof max !== "bigint" || max < 0n) {
-         throw new RangeError("maxBalance must be a non-negative bigint");
-       }
+       if (typeof max !== "bigint" || max < 0n) {}

[Survived] LogicalOperator
builder/implementation/wallet.ts:73:9
-       if (typeof initial !== "bigint" || initial < 0n) {
+       if (typeof initial !== "bigint" && initial < 0n) {

[Survived] ConditionalExpression
builder/implementation/wallet.ts:73:40
-       if (typeof initial !== "bigint" || initial < 0n) {
+       if (typeof initial !== "bigint" || false) {

[Survived] BlockStatement
builder/implementation/wallet.ts:73:54
-       if (typeof initial !== "bigint" || initial < 0n) {
-         throw new RangeError("initialBalance must be a non-negative bigint");
-       }
+       if (typeof initial !== "bigint" || initial < 0n) {}

[Survived] ConditionalExpression
builder/implementation/wallet.ts:76:9
-       if (initial > max) {
+       if (false) {

[Survived] EqualityOperator
builder/implementation/wallet.ts:76:9
-       if (initial > max) {
+       if (initial >= max) {

[Survived] BlockStatement
builder/implementation/wallet.ts:76:24
-       if (initial > max) {
-         throw new RangeError("initialBalance must not exceed maxBalance");
-       }
+       if (initial > max) {}

[Survived] BlockStatement
builder/implementation/wallet.ts:89:28
-     get maxBalance(): bigint {
-       return this.#maxBalance;
-     }
+     get maxBalance(): bigint {}

[Survived] ConditionalExpression
builder/implementation/wallet.ts:115:9
-       if (value === null) return this.#reject("INVALID_AMOUNT");
+       if (false) return this.#reject("INVALID_AMOUNT");

[Survived] StringLiteral
builder/implementation/wallet.ts:115:45
-       if (value === null) return this.#reject("INVALID_AMOUNT");
+       if (value === null) return this.#reject("");
