[Killed] ArithmeticOperator
builder/implementation/wallet.ts:50:29
   maxBalance?: bigint;
 }
 
-const DEFAULT_MAX_BALANCE = (1n << 63n) - 1n; // 9223372036854775807
+const DEFAULT_MAX_BALANCE = (1n << 63n) + 1n; // 9223372036854775807
 
 /** Normalize an Amount to a bigint, or return null if it is not a valid integer amount. */
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (291.010917ms)

  ✔ a balance held near zero survives concurrent draining (101.505958ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.707125ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.121958ms)
✔ S5 — concurrency (401.701125ms)
▶

[Killed] BlockStatement
builder/implementation/wallet.ts:53:53
 const DEFAULT_MAX_BALANCE = (1n << 63n) - 1n; // 9223372036854775807
 
 /** Normalize an Amount to a bigint, or return null if it is not a valid integer amount. */
-function toIntAmount(amount: Amount): bigint | null {
-  if (typeof amount === "bigint") return amount;
-  if (typeof amount === "number") {
-    // Rejects NaN, Infinity, and any non-integer or precision-losing magnitude.
-    if (!Number.isSafeInteger(amount)) return null;
-    return BigInt(amount);
-  }
-  return null;
-}
+function toIntAmount(amount: Amount): bigint | null {}
 
 export class Wallet {
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (25.15125ms)
  ✖ a balance held near zero survives concurrent draining (31.47725ms)

  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.28275ms)

  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (8.874334ms)
✖ S5 — concurrency (66.934667ms)

[Killed] EqualityOperator
builder/implementation/wallet.ts:54:7
 
 /** Normalize an Amount to a bigint, or return null if it is not a valid integer amount. */
 function toIntAmount(amount: Amount): bigint | null {
-  if (typeof amount === "bigint") return amount;
+  if (typeof amount !== "bigint") return amount;
   if (typeof amount === "number") {
     // Rejects NaN, Infinity, and any non-integer or precision-losing magnitude.
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (233.411083ms)

  ✖ a balance held near zero survives concurrent draining (104.393667ms)
  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.334125ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.127ms)
✖ S5 — concurrency (340.1225ms)
▶ Seri

[Killed] ConditionalExpression
builder/implementation/wallet.ts:54:7
 
 /** Normalize an Amount to a bigint, or return null if it is not a valid integer amount. */
 function toIntAmount(amount: Amount): bigint | null {
-  if (typeof amount === "bigint") return amount;
+  if (false) return amount;
   if (typeof amount === "number") {
     // Rejects NaN, Infinity, and any non-integer or precision-losing magnitude.
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (178.322709ms)

  ✖ a balance held near zero survives concurrent draining (119.503166ms)
  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.285125ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.118625ms)
✖ S5 — concurrency (299.88525ms)
▶

[Killed] ConditionalExpression
builder/implementation/wallet.ts:55:7
 /** Normalize an Amount to a bigint, or return null if it is not a valid integer amount. */
 function toIntAmount(amount: Amount): bigint | null {
   if (typeof amount === "bigint") return amount;
-  if (typeof amount === "number") {
+  if (false) {
     // Rejects NaN, Infinity, and any non-integer or precision-losing magnitude.
     if (!Number.isSafeInteger(amount)) return null;
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (203.623792ms)
  ✔ a balance held near zero survives concurrent draining (71.286458ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.708166ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.117958ms)
✔ S5 — concurrency (276.377083ms)
▶ S

[Killed] BlockStatement
builder/implementation/wallet.ts:55:35
 /** Normalize an Amount to a bigint, or return null if it is not a valid integer amount. */
 function toIntAmount(amount: Amount): bigint | null {
   if (typeof amount === "bigint") return amount;
-  if (typeof amount === "number") {
-    // Rejects NaN, Infinity, and any non-integer or precision-losing magnitude.
-    if (!Number.isSafeInteger(amount)) return null;
-    return BigInt(amount);
-  }
+  if (typeof amount === "number") {}
   return null;
 }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (233.769375ms)

  ✔ a balance held near zero survives concurrent draining (127.537166ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.703125ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.510916ms)
✔ S5 — concurrency (388.622709ms)
▶

[Killed] ConditionalExpression
builder/implementation/wallet.ts:57:9
   if (typeof amount === "bigint") return amount;
   if (typeof amount === "number") {
     // Rejects NaN, Infinity, and any non-integer or precision-losing magnitude.
-    if (!Number.isSafeInteger(amount)) return null;
+    if (false) return null;
     return BigInt(amount);
   }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (378.474125ms)
  ✔ a balance held near zero survives concurrent draining (115.10525ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.739208ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.127416ms)
✔ S5 — concurrency (495.051917ms)
▶ S

[Killed] BooleanLiteral
builder/implementation/wallet.ts:57:9
   if (typeof amount === "bigint") return amount;
   if (typeof amount === "number") {
     // Rejects NaN, Infinity, and any non-integer or precision-losing magnitude.
-    if (!Number.isSafeInteger(amount)) return null;
+    if (Number.isSafeInteger(amount)) return null;
     return BigInt(amount);
   }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (228.256958ms)

  ✔ a balance held near zero survives concurrent draining (67.213958ms)

  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.724125ms)

  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.122208ms)

[Killed] BlockStatement
builder/implementation/wallet.ts:67:44
   #balance: bigint;
   readonly #maxBalance: bigint;
 
-  constructor(options: WalletOptions = {}) {
-    const max = options.maxBalance ?? DEFAULT_MAX_BALANCE;
-    const initial = options.initialBalance ?? 0n;
-    if (typeof max !== "bigint" || max < 0n) {
-      throw new RangeError("maxBalance must be a non-negative bigint");
-    }
-    if (typeof initial !== "bigint" || initial < 0n) {
-      throw new RangeError("initialBalance must be a non-negative bigint");
-    }
-    if (initial > max) {
-      throw new RangeError("initialBalance must not exceed maxBalance");
-    }
-    this.#balance = initial;
-    this.#maxBalance = max;
-  }
+  constructor(options: WalletOptions = {}) {}
 
   /** Current balance in minor units. Reads never mutate state. */
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (54.257583ms)
  ✖ a balance held near zero survives concurrent draining (0.342167ms)

  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (3.558625ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.189209ms)
✖ S5 — concurrency (58.969625ms)
▶ Ser

[Killed] LogicalOperator
builder/implementation/wallet.ts:68:17
   readonly #maxBalance: bigint;
 
   constructor(options: WalletOptions = {}) {
-    const max = options.maxBalance ?? DEFAULT_MAX_BALANCE;
+    const max = options.maxBalance && DEFAULT_MAX_BALANCE;
     const initial = options.initialBalance ?? 0n;
     if (typeof max !== "bigint" || max < 0n) {
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (1.485959ms)
  ✖ a balance held near zero survives concurrent draining (1.010583ms)
  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.203125ms)

  ✖ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.104708ms)

✖ S5 — concurrency (9.139083ms)

[Killed] LogicalOperator
builder/implementation/wallet.ts:69:21
 
   constructor(options: WalletOptions = {}) {
     const max = options.maxBalance ?? DEFAULT_MAX_BALANCE;
-    const initial = options.initialBalance ?? 0n;
+    const initial = options.initialBalance && 0n;
     if (typeof max !== "bigint" || max < 0n) {
       throw new RangeError("maxBalance must be a non-negative bigint");
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (330.299666ms)

  ✔ a balance held near zero survives concurrent draining (98.460875ms)

  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.3545ms)

  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.120833ms)

[Killed] ConditionalExpression
builder/implementation/wallet.ts:70:9
   constructor(options: WalletOptions = {}) {
     const max = options.maxBalance ?? DEFAULT_MAX_BALANCE;
     const initial = options.initialBalance ?? 0n;
-    if (typeof max !== "bigint" || max < 0n) {
+    if (false) {
       throw new RangeError("maxBalance must be a non-negative bigint");
     }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (358.985375ms)

  ✔ a balance held near zero survives concurrent draining (219.678958ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.729167ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.125875ms)

✔ S5 — concurrency (580.143292ms)

[Killed] ConditionalExpression
builder/implementation/wallet.ts:70:9
   constructor(options: WalletOptions = {}) {
     const max = options.maxBalance ?? DEFAULT_MAX_BALANCE;
     const initial = options.initialBalance ?? 0n;
-    if (typeof max !== "bigint" || max < 0n) {
+    if (false || max < 0n) {
       throw new RangeError("maxBalance must be a non-negative bigint");
     }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (282.010083ms)
  ✔ a balance held near zero survives concurrent draining (145.95875ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (3.002416ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.177042ms)
✔ S5 — concurrency (431.7675ms)
▶ Ser

[Killed] LogicalOperator
builder/implementation/wallet.ts:73:9
     if (typeof max !== "bigint" || max < 0n) {
       throw new RangeError("maxBalance must be a non-negative bigint");
     }
-    if (typeof initial !== "bigint" || initial < 0n) {
+    if (typeof initial !== "bigint" && initial < 0n) {
       throw new RangeError("initialBalance must be a non-negative bigint");
     }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (298.554167ms)
  ✔ a balance held near zero survives concurrent draining (158.58025ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.796ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (1.966792ms)
✔ S5 — concurrency (461.53825ms)
▶ Seria

[Killed] BlockStatement
builder/implementation/wallet.ts:73:54
     if (typeof max !== "bigint" || max < 0n) {
       throw new RangeError("maxBalance must be a non-negative bigint");
     }
-    if (typeof initial !== "bigint" || initial < 0n) {
-      throw new RangeError("initialBalance must be a non-negative bigint");
-    }
+    if (typeof initial !== "bigint" || initial < 0n) {}
     if (initial > max) {
       throw new RangeError("initialBalance must not exceed maxBalance");
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (246.201042ms)

  ✔ a balance held near zero survives concurrent draining (199.120041ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (2.723583ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.970834ms)
✔ S5 — concurrency (485.423083ms)
▶

[Survived] StringLiteral
builder/implementation/wallet.ts:74:28
       throw new RangeError("maxBalance must be a non-negative bigint");
     }
     if (typeof initial !== "bigint" || initial < 0n) {
-      throw new RangeError("initialBalance must be a non-negative bigint");
+      throw new RangeError("");
     }
     if (initial > max) {

[Killed] EqualityOperator
builder/implementation/wallet.ts:76:9
     if (typeof initial !== "bigint" || initial < 0n) {
       throw new RangeError("initialBalance must be a non-negative bigint");
     }
-    if (initial > max) {
+    if (initial <= max) {
       throw new RangeError("initialBalance must not exceed maxBalance");
     }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (86.641584ms)

  ✖ a balance held near zero survives concurrent draining (0.13725ms)
  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.0825ms)
  ✖ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.047041ms)
✖ S5 — concurrency (119.272583ms)
▶ Seria

[Killed] ConditionalExpression
builder/implementation/wallet.ts:76:9
     if (typeof initial !== "bigint" || initial < 0n) {
       throw new RangeError("initialBalance must be a non-negative bigint");
     }
-    if (initial > max) {
+    if (true) {
       throw new RangeError("initialBalance must not exceed maxBalance");
     }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (0.626334ms)
  ✖ a balance held near zero survives concurrent draining (30.707333ms)
  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (29.463584ms)
  ✖ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.142417ms)

✖ S5 — concurrency (61.715708ms)
▶ Se

[Survived] StringLiteral
builder/implementation/wallet.ts:77:28
       throw new RangeError("initialBalance must be a non-negative bigint");
     }
     if (initial > max) {
-      throw new RangeError("initialBalance must not exceed maxBalance");
+      throw new RangeError("");
     }
     this.#balance = initial;

[Killed] BlockStatement
builder/implementation/wallet.ts:84:21
   }
 
   /** Current balance in minor units. Reads never mutate state. */
-  balance(): bigint {
-    return this.#balance;
-  }
+  balance(): bigint {}
 
   /** Inclusive maximum balance this wallet permits. */
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (11.578666ms)

  ✖ a balance held near zero survives concurrent draining (0.809166ms)
  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.275209ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.1245ms)
✖ S5 — concurrency (14.411875ms)
▶ Seria

[Killed] BlockStatement
builder/implementation/wallet.ts:89:28
   }
 
   /** Inclusive maximum balance this wallet permits. */
-  get maxBalance(): bigint {
-    return this.#maxBalance;
-  }
+  get maxBalance(): bigint {}
 
   /**
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (122.43375ms)
  ✔ a balance held near zero survives concurrent draining (215.002333ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.080166ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.134ms)
✔ S5 — concurrency (482.750833ms)

▶ Ser

[Killed] BlockStatement
builder/implementation/wallet.ts:97:41
    * Increase the balance by `amount`. Rejects (without mutating) invalid,
    * non-positive, or limit-exceeding amounts.
    */
-  deposit(amount: Amount): WalletResult {
-    const value = toIntAmount(amount);
-    if (value === null) return this.#reject("INVALID_AMOUNT");
-    if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
-    if (value > this.#maxBalance - this.#balance) {
-      return this.#reject("BALANCE_LIMIT_EXCEEDED");
-    }
-    this.#balance += value;
-    return { ok: true, balance: this.#balance };
-  }
+  deposit(amount: Amount): WalletResult {}
 
   /**
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (4.559041ms)
  ✔ a balance held near zero survives concurrent draining (366.619917ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.06625ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.126667ms)
✖ S5 — concurrency (373.376542ms)
▶ Ser

[Killed] ConditionalExpression
builder/implementation/wallet.ts:99:9
    */
   deposit(amount: Amount): WalletResult {
     const value = toIntAmount(amount);
-    if (value === null) return this.#reject("INVALID_AMOUNT");
+    if (false) return this.#reject("INVALID_AMOUNT");
     if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
     if (value > this.#maxBalance - this.#balance) {
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (280.389167ms)

  ✔ a balance held near zero survives concurrent draining (120.183584ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.404041ms)

  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.305708ms)

[Killed] ConditionalExpression
builder/implementation/wallet.ts:99:9
    */
   deposit(amount: Amount): WalletResult {
     const value = toIntAmount(amount);
-    if (value === null) return this.#reject("INVALID_AMOUNT");
+    if (true) return this.#reject("INVALID_AMOUNT");
     if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
     if (value > this.#maxBalance - this.#balance) {
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (325.50475ms)

  ✔ a balance held near zero survives concurrent draining (57.7955ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.716625ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.122459ms)
✔ S5 — concurrency (384.768ms)

[Killed] EqualityOperator
builder/implementation/wallet.ts:100:9
   deposit(amount: Amount): WalletResult {
     const value = toIntAmount(amount);
     if (value === null) return this.#reject("INVALID_AMOUNT");
-    if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
+    if (value < 0n) return this.#reject("NON_POSITIVE_AMOUNT");
     if (value > this.#maxBalance - this.#balance) {
       return this.#reject("BALANCE_LIMIT_EXCEEDED");
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (378.224667ms)
  ✔ a balance held near zero survives concurrent draining (99.169583ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.744084ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.122333ms)
✔ S5 — concurrency (478.854042ms)
▶ S

[Killed] EqualityOperator
builder/implementation/wallet.ts:100:9
   deposit(amount: Amount): WalletResult {
     const value = toIntAmount(amount);
     if (value === null) return this.#reject("INVALID_AMOUNT");
-    if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
+    if (value > 0n) return this.#reject("NON_POSITIVE_AMOUNT");
     if (value > this.#maxBalance - this.#balance) {
       return this.#reject("BALANCE_LIMIT_EXCEEDED");
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (235.941333ms)
  ✔ a balance held near zero survives concurrent draining (144.19375ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.54725ms)

  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (1.390833ms)
✔ S5 — concurrency (383.760542ms)
▶ S

[Killed] EqualityOperator
builder/implementation/wallet.ts:101:9
     const value = toIntAmount(amount);
     if (value === null) return this.#reject("INVALID_AMOUNT");
     if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
-    if (value > this.#maxBalance - this.#balance) {
+    if (value >= this.#maxBalance - this.#balance) {
       return this.#reject("BALANCE_LIMIT_EXCEEDED");
     }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (363.703542ms)

  ✔ a balance held near zero survives concurrent draining (176.125125ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.218625ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.152875ms)
✔ S5 — concurrency (541.848666ms)
▶

[Killed] ArithmeticOperator
builder/implementation/wallet.ts:101:17
     const value = toIntAmount(amount);
     if (value === null) return this.#reject("INVALID_AMOUNT");
     if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
-    if (value > this.#maxBalance - this.#balance) {
+    if (value > this.#maxBalance + this.#balance) {
       return this.#reject("BALANCE_LIMIT_EXCEEDED");
     }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (319.857875ms)
  ✔ a balance held near zero survives concurrent draining (145.437625ms)

  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.780583ms)

  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.137083ms)

[Killed] AssignmentOperator
builder/implementation/wallet.ts:104:5
     if (value > this.#maxBalance - this.#balance) {
       return this.#reject("BALANCE_LIMIT_EXCEEDED");
     }
-    this.#balance += value;
+    this.#balance -= value;
     return { ok: true, balance: this.#balance };
   }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (11.237291ms)
  ✖ a balance held near zero survives concurrent draining (0.79775ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.710042ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.130291ms)
✖ S5 — concurrency (13.503042ms)
▶ Seria

[Killed] BooleanLiteral
builder/implementation/wallet.ts:105:18
       return this.#reject("BALANCE_LIMIT_EXCEEDED");
     }
     this.#balance += value;
-    return { ok: true, balance: this.#balance };
+    return { ok: false, balance: this.#balance };
   }
 
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (236.178583ms)
  ✔ a balance held near zero survives concurrent draining (77.661916ms)
  ✔ A-2: check-then-act across an await is racy (compound ops are not atomic) (3.628042ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.319667ms)
✖ S5 — concurrency (320.096333ms)
▶ S

[Killed] BlockStatement
builder/implementation/wallet.ts:113:42
    * non-positive, or insufficient-funds amounts. The balance can never become
    * negative.
    */
-  withdraw(amount: Amount): WalletResult {
-    const value = toIntAmount(amount);
-    if (value === null) return this.#reject("INVALID_AMOUNT");
-    if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
-    if (value > this.#balance) return this.#reject("INSUFFICIENT_FUNDS");
-    this.#balance -= value;
-    return { ok: true, balance: this.#balance };
-  }
+  withdraw(amount: Amount): WalletResult {}
 
   #reject(error: WalletErrorCode): WalletResult {
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (68.863708ms)
  ✖ a balance held near zero survives concurrent draining (0.420292ms)

  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.082667ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.641875ms)
✖ S5 — concurrency (70.655167ms)
▶ Ser

[Killed] EqualityOperator
builder/implementation/wallet.ts:115:9
    */
   withdraw(amount: Amount): WalletResult {
     const value = toIntAmount(amount);
-    if (value === null) return this.#reject("INVALID_AMOUNT");
+    if (value !== null) return this.#reject("INVALID_AMOUNT");
     if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
     if (value > this.#balance) return this.#reject("INSUFFICIENT_FUNDS");
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (222.434ms)

  ✖ a balance held near zero survives concurrent draining (107.134542ms)

  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.841542ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.142208ms)

[Killed] ConditionalExpression
builder/implementation/wallet.ts:116:9
   withdraw(amount: Amount): WalletResult {
     const value = toIntAmount(amount);
     if (value === null) return this.#reject("INVALID_AMOUNT");
-    if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
+    if (true) return this.#reject("NON_POSITIVE_AMOUNT");
     if (value > this.#balance) return this.#reject("INSUFFICIENT_FUNDS");
     this.#balance -= value;
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (299.537458ms)

  ✖ a balance held near zero survives concurrent draining (153.144458ms)

  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (7.994792ms)

  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.134875ms)

[Killed] ConditionalExpression
builder/implementation/wallet.ts:117:9
     const value = toIntAmount(amount);
     if (value === null) return this.#reject("INVALID_AMOUNT");
     if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
-    if (value > this.#balance) return this.#reject("INSUFFICIENT_FUNDS");
+    if (false) return this.#reject("INSUFFICIENT_FUNDS");
     this.#balance -= value;
     return { ok: true, balance: this.#balance };
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (99.911042ms)
  ✖ a balance held near zero survives concurrent draining (1.454542ms)
  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.2365ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.115833ms)
✖ S5 — concurrency (103.934125ms)
▶ Seria

[Killed] EqualityOperator
builder/implementation/wallet.ts:117:9
     const value = toIntAmount(amount);
     if (value === null) return this.#reject("INVALID_AMOUNT");
     if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
-    if (value > this.#balance) return this.#reject("INSUFFICIENT_FUNDS");
+    if (value >= this.#balance) return this.#reject("INSUFFICIENT_FUNDS");
     this.#balance -= value;
     return { ok: true, balance: this.#balance };
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (228.867834ms)

  ✔ a balance held near zero survives concurrent draining (103.587458ms)
  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.970459ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.164167ms)

✖ S5 — concurrency (335.274584ms)

[Killed] AssignmentOperator
builder/implementation/wallet.ts:118:5
     if (value === null) return this.#reject("INVALID_AMOUNT");
     if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
     if (value > this.#balance) return this.#reject("INSUFFICIENT_FUNDS");
-    this.#balance -= value;
+    this.#balance += value;
     return { ok: true, balance: this.#balance };
   }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (235.896791ms)
  ✔ a balance held near zero survives concurrent draining (253.7155ms)

  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (3.526417ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.165167ms)
✖ S5 — concurrency (494.202208ms)
▶ S
