[Killed] BooleanLiteral
builder/implementation/wallet.ts:119:18
     if (value <= 0n) return this.#reject("NON_POSITIVE_AMOUNT");
     if (value > this.#balance) return this.#reject("INSUFFICIENT_FUNDS");
     this.#balance -= value;
-    return { ok: true, balance: this.#balance };
+    return { ok: false, balance: this.#balance };
   }
 
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✖ async interleaving cannot break the invariant (methods are synchronous) (266.429208ms)

  ✖ a balance held near zero survives concurrent draining (98.561083ms)
  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (1.333625ms)

  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.132833ms)

[Killed] BlockStatement
builder/implementation/wallet.ts:122:49
     return { ok: true, balance: this.#balance };
   }
 
-  #reject(error: WalletErrorCode): WalletResult {
-    // State is intentionally left untouched here.
-    return { ok: false, error, balance: this.#balance };
-  }
+  #reject(error: WalletErrorCode): WalletResult {}
 }
 
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (103.383792ms)

  ✖ a balance held near zero survives concurrent draining (0.6755ms)
  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (0.087292ms)

  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.690541ms)

[Killed] BooleanLiteral
builder/implementation/wallet.ts:124:18
 
   #reject(error: WalletErrorCode): WalletResult {
     // State is intentionally left untouched here.
-    return { ok: false, error, balance: this.#balance };
+    return { ok: true, error, balance: this.#balance };
   }
 }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (111.87475ms)

  ✔ a balance held near zero survives concurrent draining (29.864875ms)
  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (2.155541ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.130333ms)
✖ S5 — concurrency (144.668834ms)
▶ S

[Killed] ObjectLiteral
builder/implementation/wallet.ts:124:12
 
   #reject(error: WalletErrorCode): WalletResult {
     // State is intentionally left untouched here.
-    return { ok: false, error, balance: this.#balance };
+    return {};
   }
 }
killedBy: All tests
statusReason: ▶ S5 — concurrency
  ✔ async interleaving cannot break the invariant (methods are synchronous) (134.48625ms)

  ✔ a balance held near zero survives concurrent draining (35.772208ms)

  ✖ A-2: check-then-act across an await is racy (compound ops are not atomic) (4.543125ms)
  ✔ A-3: a Wallet cannot be shared across threads (structuredClone drops it) (0.127792ms)
