[Killed] EqualityOperator
builder/implementation/wallet.ts:70:9
   constructor(options: WalletOptions = {}) {
     const max = options.maxBalance ?? DEFAULT_MAX_BALANCE;
     const initial = options.initialBalance ?? 0n;
-    if (typeof max !== "bigint" || max < 0n) {
+    if (typeof max === "bigint" || max < 0n) {
       throw new RangeError("maxBalance must be a non-negative bigint");
     }
killedBy: All tests
statusReason: ✖ new wallet starts at zero by default (3.407375ms)
✖ deposit increases balance by exactly the amount (0.14675ms)
✖ withdraw decreases balance by exactly the amount (0.096792ms)
✖ balance never becomes negative; overdraw is rejected and state unchanged (0.091208ms)
✖ withdrawing the exact balance is allowed and lands on zero (0.082542ms)
✖ zero amount is rejected as NON_POSITIVE_AMOUNT (deposit an

[Killed] EqualityOperator
builder/implementation/wallet.ts:70:36
   constructor(options: WalletOptions = {}) {
     const max = options.maxBalance ?? DEFAULT_MAX_BALANCE;
     const initial = options.initialBalance ?? 0n;
-    if (typeof max !== "bigint" || max < 0n) {
+    if (typeof max !== "bigint" || max >= 0n) {
       throw new RangeError("maxBalance must be a non-negative bigint");
     }
killedBy: All tests
statusReason: ✖ new wallet starts at zero by default (1.7735ms)
✖ deposit increases balance by exactly the amount (0.062916ms)
✖ withdraw decreases balance by exactly the amount (0.109709ms)
✖ balance never becomes negative; overdraw is rejected and state unchanged (0.064667ms)
✖ withdrawing the exact balance is allowed and lands on zero (0.052417ms)
✖ zero amount is rejected as NON_POSITIVE_AMOUNT (deposit and

[Killed] EqualityOperator
builder/implementation/wallet.ts:73:40
     if (typeof max !== "bigint" || max < 0n) {
       throw new RangeError("maxBalance must be a non-negative bigint");
     }
-    if (typeof initial !== "bigint" || initial < 0n) {
+    if (typeof initial !== "bigint" || initial <= 0n) {
       throw new RangeError("initialBalance must be a non-negative bigint");
     }
killedBy: All tests
statusReason: ✖ new wallet starts at zero by default (1.605083ms)
✖ deposit increases balance by exactly the amount (0.062541ms)
✔ withdraw decreases balance by exactly the amount (1.499667ms)
✔ balance never becomes negative; overdraw is rejected and state unchanged (0.162292ms)
✔ withdrawing the exact balance is allowed and lands on zero (0.142292ms)

✔ zero amount is rejected as NON_POSITIVE_AMOUNT (deposit

[Killed] ConditionalExpression
builder/implementation/wallet.ts:73:9
     if (typeof max !== "bigint" || max < 0n) {
       throw new RangeError("maxBalance must be a non-negative bigint");
     }
-    if (typeof initial !== "bigint" || initial < 0n) {
+    if (true) {
       throw new RangeError("initialBalance must be a non-negative bigint");
     }
killedBy: All tests
statusReason: ✖ new wallet starts at zero by default (2.905292ms)

✖ deposit increases balance by exactly the amount (0.086917ms)
✖ withdraw decreases balance by exactly the amount (0.053625ms)
✖ balance never becomes negative; overdraw is rejected and state unchanged (0.048458ms)
✖ withdrawing the exact balance is allowed and lands on zero (0.043542ms)
✖ zero amount is rejected as NON_POSITIVE_AMOUNT (deposit
